app/services/Validate/validate_url_service.rb

INSERT INTO "urls" ("address", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["address", "gorails.com"], ["created_at", "2022-08-31 21:12:35.206153"], ["updated_at", "2022-08-31 21:12:35.206153"]]
---
    def process!
      domain = extract_domain
      v = DomainNameValidator.new
      if v.validate(domain)
        Url.create(address: domain)