app/controllers/urls_controller.rb

INSERT INTO "urls" ("address", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["address", "rubygems.org"], ["created_at", "2022-08-31 21:17:55.166778"], ["updated_at", "2022-08-31 21:17:55.166778"]]
SELECT "urls"."address" FROM "urls" ORDER BY urls.created_at DESC
---
  def add_new_url
    h = Validate::ValidateUrlService.new(params[:address]).process!
    if h
      respond_to do |format|
        urls = Url.all.order( 'urls.created_at DESC').pluck(:address)